# RebarSpacingTooSmall Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RebarFailures..::..RebarSpacingTooSmall Property
BuiltInFailures..::..RebarFailures Class See Also
---
Bar Spacing is too small.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId RebarSpacingTooSmall { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RebarSpacingTooSmall As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ RebarSpacingTooSmall {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RebarFailures Class
Autodesk.Revit.DB Namespace